{
  "markdown": "Making sense of recent volatility—an update from our Wealth CIO\n\n[Get update](https://www.tiaa.org/public/invest/services/wealth-management/perspectives/wealth-cio)\n\n## Wealth management\n\n# Partner with us for actionable financial advice®\n\nLet our financial advisors help you make more informed decisions today that prepare you for tomorrow.\n\n[Schedule an appointment](https://shared.tiaa.org/private/tools/directscheduler/options-to-schedule?category=retirement)\n\n![](https://s7d1.scene7.com/is/image/tiaastage/couple?ts=1753121231846)\n\n## Work with one of our wealth management financial advisors.\n\n![Women resting head on hand](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\n### Starting your career or savings?\n\nGet personalized financial advice from our Guided Advice Team to help make a plan for a secure future.\n\nEligibility: $100K–$250K in investments outside your employer-sponsored retirement plan\n\n[Learn more](https://www.tiaa.org/public/invest/services/wealth-management/guided-financial-advice)\n\n![Man cheerfully smiling](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\n### Mid-career and looking for advice?\n\nGet a dedicated advisor for guidance on your investments and to create a personal financial plan.\n\nEligibility: $250K–$1M in investments outside your employer-sponsored retirement plan\n\n[Learn more](https://www.tiaa.org/public/invest/services/wealth-management/dedicated-financial-advisor)\n\n![Man in his 60s smiling](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\n### Approaching retirement?\n\nGet unparalleled service from a dedicated team of specialists to guide you into retirement by creating an income, legacy and tax plan.\n\nEligibility: $1M in or outside of your employer-sponsored plan\n\n[Learn more](https://www.tiaa.org/public/invest/services/wealth-management/dedicated-wealth-management-team)\n\n### Why work with a TIAA personal financial advisor?\n\n![](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\n#### Our advice is easier to access and act on.\n\nFrom advice available at every career stage to financial plans and income road mapping at no added cost, we make it easier to get professional, personalized help.\n\n![](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\n#### Our advisors can help create income you can’t outlive.\n\nWith our TIAA Traditional fixed annuity as part of your personalized financial plan,\\* get guaranteed growth and money coming in for the rest of your life.1\n\n![](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\n#### We help you make consistent progress.\n\nOur financial advisors are here to help you with a personalized roadmap that is flexible enough to evolve as things change.\n\n\\*TIAA Traditional is issued by Teachers Insurance and Annuity Association of America (TIAA), New York, NY.\n\n## FINANCIAL PLANNING SERVICES\n\n### We offer an array of wealth management solutions.\n\nBuild and adjust your portfolio based on your goals. Do it yourself, ask us for help or let us fully manage it on your behalf.\n\n[Explore all solutions](https://www.tiaa.org/public/invest/services/wealth-management/investment-products)\n\n## Cio perspectives\n\n### 2025 Midyear Outlook\n\nFeaturing Ali Dellinger, Senior Director of TIAA Wealth CIO Communications.\n\nThe Wealth CIO team of experts outline their perspectives and scenarios for financial markets during the second half of 2025 in Charting Potential Outcomes.\n\n[Read outlook](https://www.tiaa.org/public/pdf/t/tiaa-cio-midyear-perspectives-2025-outlook.pdf)\n\n![Ali Dellinger speaking about TIAA’s 2025 midyear outlook and wealth implications](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\n[Play video](https://www.tiaa.org/public/invest/services/wealth-management# \"Play video\")\n\n## “Until we started working with Jessica I’m not sure I knew we needed wealth management services. She is so clear and helpful in all of her work with us that I have already recommended her to family members, and would continue to recommend her to anyone who needs clear-eyed and personalized advice regarding retirement planning and wealth management. She is also delightful, and I am grateful for her attention to our needs.\n\nTIAA client\n\nThis testimonial was provided by a current client, and no direct or indirect compensation was given in return. No material conflicts of interest exist on the part of the individual giving the testimonial, resulting from their relationship with the adviser. Results experienced may not be representative of the experience of other clients and there is no guarantee of future performance or success.\n\n### What people ask us.\n\n#### What is wealth management?\n\nWealth management is a service that helps people maintain, increase and transfer their money. Generally offered by professional financial services companies, wealth management can include advice, investment management, retirement planning, tax strategies and estate planning. While often associated with the ultra-wealthy, those with more modest income and savings can also benefit from working with a professional.\n\n#### What is private wealth management?\n\nPrivate wealth management is another way of saying wealth management, though sometimes people use the phrase \"private wealth management\" to indicate that these services are for ultra-high net worth individuals and families.\n\n#### What does a wealth manager do?\n\nA wealth manager is a financial professional who helps people manage and grow their money. They can provide advice on investing, retirement, taxes, estate planning and more.\n\n## Need more information?\n\nSchedule a complimentary meeting with one of our team members or consultants, who will answer all your questions and advise on next steps.\n\nCall 844-567-9077, or schedule a time with us.\n\n[Schedule an appointment](https://shared.tiaa.org/private/tools/directscheduler/options-to-schedule?category=retirement)\n\n![TIAA Wealth Management logo](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\n## FEATURED WEALTH INSIGHTS\n\n### Articles you might find helpful\n\n![](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\n#### Inheriting an IRA: What you need to know\n\nHere’s how to smooth the process and minimize the tax hit.\n\n5 min read\n\n[Read article](https://www.tiaa.org/public/invest/services/wealth-management/perspectives/inheritinganira)\n\n![](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\n#### Do I need a financial advisor? Five signs to say yes.\n\nYou may suspect there are ways to upgrade your financial plan, but is it worth the time and cost?\n\n3 min read\n\n[Read article](https://www.tiaa.org/public/invest/services/wealth-management/perspectives/needanadvisor)\n\n![](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\n#### Top estate planning pitfalls and how to avoid them\n\nStarting the conversation with your loved ones can go a long way. Here are top items to discuss\n\n5.5 min read\n\n[Read article](https://www.tiaa.org/public/invest/services/wealth-management/perspectives/estate-planning-pitfalls)\n\n1 Annuity contracts may contain terms for keeping them in force. We can provide you with costs and complete details.\n\nTIAA Traditional is a fixed-annuity product issued through these contracts by Teachers Insurance and Annuity Association of America (TIAA), 730 Third Avenue, New York, NY, 10017: Form series including but not limited to: 1000.24; G-1000.4; IGRS-01-84-ACC; IGRSP-01-84-ACC; 6008.8. Not all contracts are available in all states or currently issued.\n\n\"Our advisors can help create income you can’t outlive\" refers to the annuity income received in retirement. Guarantees of fixed monthly payments are only associated with TIAA's fixed annuities. Any guarantees under annuities issued by TIAA are subject to TIAA's claims-paying ability.\n\nAdvisory services are provided by Advice & Planning Services, a division of TIAA-CREF Individual & Institutional Services, LLC, a registered investment adviser.\n\nWe do not charge you a separate fee for the Planning Services, but reserve the right to do so in the future. However, TC Services, its financial professionals and TIAA affiliates receive compensation if you choose an account, product, or buy or sell securities we recommend after receiving the Planning Services. You will pay the fees and costs associated with the account, product, purchase or sale.\n\nThis material is for informational or educational purposes only and is not fiduciary investment advice, or a securities, investment strategy, or insurance product recommendation. This material does not consider an individual’s own objectives or circumstances which should be the basis of any investment decision.\n\n4598150",
  "metadata": {
    "title": "Financial Planning & Wealth Management Services | TIAA",
    "template": "ethos-page-content",
    "language": "en",
    "viewport": "width=device-width, initial-scale=1",
    "description": "Craft a personalized wealth management strategy with TIAA's Advisors for financial planning & growth. Learn more about our wealth management services.",
    "theme-color": "#2196F3",
    "favicon": "https://www.tiaa.org/content/dam/tiaa/global/logo/tiaa04016404.ico",
    "scrapeId": "71c18af6-d0f6-4d78-b56e-d2639f650043",
    "sourceURL": "https://www.tiaa.org/public/invest/services/wealth-management",
    "url": "https://www.tiaa.org/public/invest/services/wealth-management",
    "statusCode": 200,
    "contentType": "text/html;charset=utf-8",
    "proxyUsed": "basic",
    "cacheState": "miss",
    "creditsUsed": 1
  },
  "warning": "This scrape job was throttled at your current concurrency limit. If you'd like to scrape faster, you can upgrade your plan."
}