{
  "markdown": "This website is intended for institutional retirement plan sponsors and their consultants, registered investment advisers, and other related businesses. If you are looking for individual services, please visit [TIAA.org](https://www.tiaa.org/public).\n\n# Retirement is changing. Give employees a guarantee.\n\nEighty percent of employers are considering guaranteed income.1 Our flagship fixed annuity, TIAA Traditional, complements bonds and can provide guaranteed income for life.\n\n[Explore now](https://www.tiaa.org/public/consultants/tiaa-traditional)\n\n## Don’t miss our new perspectives on these topics.\n\n### Big ideas. Better retirements.\n\nThe 5th Edition of TIAA’s TMRW publication brings the latest retirement insights to employers, employees and plan consultants.\n\n[Explore TMRWRead more](https://www.tiaa.org/public/plansponsors/insights/tmrw/edition-5)\n\nBuild a better retirement: Health care\n\nHealthcare employers remain committed to helping their employees achieve successful retirements, but they want their plans to work harder.\n\n[Go to article](https://www.tiaa.org/public/plansponsors/insights/thought-leadership/plan-sponsor-retirement-survey-results/healthcare-retirement-plan-survey)\n\n### What's in store for the TIAA General Account in 2025\n\nCIO Emily Wiener explains how she plans to keep the portfolio resilient through expected market volatility.\n\n[Go to articleGo to article](https://www.tiaa.org/public/plansponsors/insights/thought-leadership/general-account-investing-in-2025)\n\n### Case study: Decreasing costs and increasing retirement security\n\nA large metro-area healthcare system cut fees, streamlined their plan menu and gave their participants the option for guaranteed retirement income—all facilitated by a consultant.\n\n[Review case studyReview case study](https://www.tiaa.org/public/plansponsors/why-tiaa/healthcare-retirement-investment-plan-case-study)\n\nPlan sponsors resources\n\n## Plan sponsors work hard. You can help them work better.\n\nTIAA’s new plan sponsor resources hub equips you with the tools, education, and news you need to support current clients and showcase your value to new ones.\n\n[View resource hub View resource hub](https://www.tiaa.org/public/plansponsors/plan-sponsors-resources)\n\n## You can differentiate your practice and help your clients simplify their plans — all while improving efficiency for everyone.\n\n![](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\nRecordkeeping\n\nYou know consolidating plans comes with countless benefits without limiting the investment options.\n\n[Learn moreLearn more](https://www.tiaa.org/public/plansponsors/retirement-plan-management)\n\n![](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\nThe default: One of their most important plan decisions\n\nYour clients want their employees to retire with confidence--help them choose a default option that includes guarantees.\n\n[Learn moreLearn more](https://www.tiaa.org/public/plansponsors/retirement-plan-management/default-solutions)\n\n![](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\nTIAA Traditional\\*\n\nSee how competitive interest rates are this month\n\n[Learn moreLearn moreOpens pdf](https://www.tiaa.org/public/pdf/t/tiaa-traditional-rates-advisor.pdf)\n\n\\*TIAA Traditional is a fixed annuity issued by Teachers Insurance and Annuity Association of America (TIAA), New York, NY.\n\n## The markets are in constant motion.\n\nSo are we. Get our take.\n\n[Market insights](https://www.tiaa.org/public/consultants/key-insights)\n\nClient management and reporting\n\n## Let TIAA Business EdgeSM help you manage your book of business.\n\nView all your clients and their plans – anywhere, anytime. And now, manage who has access to Business Edge at your firm.\n\n[Learn more](https://www.tiaa.org/public/consultants/business-edge)\n\n## We're here to help.\n\nTo get in touch, contact your Consultant Relations representative or request contact via the button below.\n\n[Request contact](https://www.tiaa.org/public/consultants/contact-tiaa)\n\n1 TIAA, Building a Better Retirement Survey, 2024.\n\nThis material is for informational or educational purposes only and is not fiduciary investment advice, or a securities, investment strategy, or insurance product recommendation. This material does not consider an individual’s own objectives or circumstances which should be the basis of any investment decision.\n\nAnnuity contracts may contain terms for keeping them in force. We can provide you with costs and complete details.\n\nAny guarantees under annuities issued by TIAA are subject to TIAA's claims-paying ability\n\nTIAA Traditional is a fixed annuity product issued through these contracts by Teachers Insurance and Annuity Association of America (TIAA), 730 Third Avenue, New York, NY, 10017: Form series including but not limited to: 1000.24; G-1000.4; IGRS-01-84-ACC; IGRSP-01-84-ACC; 6008.8. Not all contracts are available in all states or currently issued.\n\n4499006",
  "metadata": {
    "language": "en",
    "favicon": "https://www.tiaa.org/content/dam/tiaa/global/logo/tiaa04016404.ico",
    "title": "Consultants | TIAA",
    "template": "page-homepage",
    "viewport": "width=device-width, initial-scale=1",
    "theme-color": "#2196F3",
    "description": "Leverage world class support from TIAA for your client’s retirement and benefits plans. From plan design and management to employee engagement and beyond – We're here to help.",
    "google-play-app": "app-id=com.mobile.tiaa.cref",
    "scrapeId": "8aec6a01-2ab3-4c3c-abd4-92fe55eb535e",
    "sourceURL": "https://www.tiaa.org/public/consultants",
    "url": "https://www.tiaa.org/public/consultants",
    "statusCode": 200,
    "contentType": "text/html;charset=utf-8",
    "proxyUsed": "basic",
    "cacheState": "miss",
    "creditsUsed": 1
  },
  "warning": "This scrape job was throttled at your current concurrency limit. If you'd like to scrape faster, you can upgrade your plan."
}