{
  "markdown": "This website is intended for institutional retirement plan sponsors and their consultants, registered investment advisers, and other related businesses. If you are looking for individual services, please visit [TIAA.org](https://www.tiaa.org/public).\n\n# Big ideas. Better retirements.\n\nThe 5th Edition of TIAA’s TMRW publication brings the latest retirement insights to employers, employees and plan consultants. Stay updated by reading TMRW here.\n\n[Explore TMRW](https://www.tiaa.org/public/plansponsors/insights/tmrw/edition-5)\n\n## Don’t miss our new perspectives on these topics.\n\n### Retirement is changing. Give employees a guarantee.\n\nEighty percent of employers are considering guaranteed income.1 Our flagship fixed annuity, TIAA Traditional, complements bonds and can provide guaranteed income for life.\n\n[Explore nowRead more](https://www.tiaa.org/public/consultants/tiaa-traditional)\n\nBuild a better retirement: Health care\n\nHealthcare employers remain committed to helping their employees achieve successful retirements, but they want their plans to work harder.\n\n[Go to article](https://www.tiaa.org/public/plansponsors/insights/thought-leadership/plan-sponsor-retirement-survey-results/healthcare-retirement-plan-survey)\n\n### What's in store for the TIAA General Account in 2025\n\nCIO Emily Wiener explains how she plans to keep the portfolio resilient through expected market volatility.\n\n[Go to articleRead more](https://www.tiaa.org/public/plansponsors/insights/thought-leadership/general-account-investing-in-2025)\n\n### Case study: Decreasing costs and increasing retirement security\n\nA large metro-area healthcare system cut fees, streamlined their plan menu and gave their participants the option for guaranteed retirement income—all facilitated by a consultant.\n\n[Review case studyLearn more](https://www.tiaa.org/public/plansponsors/why-tiaa/healthcare-retirement-investment-plan-case-study)\n\nPlan sponsor resources\n\n## Plan sponsors work hard. We can help.\n\nYour job is difficult. And retirement plans can be complex. So we’ve created a digital destination to keep you up to date on technology, legislation, employee engagement and more – all to make your workday a little easier.\n\n[View resource hub View resource hub](https://www.tiaa.org/public/plansponsors/plan-sponsors-resources)\n\n## You can simplify your plan for your employees—and improve efficiency for everyone at the same time.\n\n![](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\nRecordkeeping\n\nConsolidating plans comes with countless benefits without limiting the investment choices you offer.\n\n[Learn moreLearn more](https://www.tiaa.org/public/plansponsors/retirement-plan-management)\n\n![](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\nThe default: One of your most important plan decisions\n\nHelp employees retire with confidence—choose a default option that includes guarantees.\n\n[Learn moreLearn more](https://www.tiaa.org/public/plansponsors/retirement-plan-management/default-solutions)\n\n![](https://www.tiaa.org/content/dam/tiaa/public/images/dummy-img.png)\n\nTIAA Traditional\\*\n\nSee how competitive interest rates are this month\n\n[Learn moreLearn moreOpens pdf](https://www.tiaa.org/public/pdf/t/tiaa-traditional-rates-advisor.pdf)\n\n\\*TIAA Traditional is a fixed annuity issued by Teachers Insurance and Annuity Association of America (TIAA), New York, NY.\n\n## The markets are in constant motion.\n\nSo are we. Get our take.\n\n[Market insights](https://www.tiaa.org/public/invest/tiaa-market-insights)\n\nGet in touch\n\n## We're here to help.\n\nContact your TIAA relationship manager or our Administrator Telephone Center at [888-842-7782](tel:888-842-7782), weekdays 8 a.m. − 8 p.m. (EST).\n\n[Contact us](https://www.tiaa.org/public/plansponsors/contact-tiaa)\n\n1 TIAA, Building a Better Retirement Survey, 2024.\n\nThis material is for informational or educational purposes only and is not fiduciary investment advice, or a securities, investment strategy, or insurance product recommendation. This material does not consider an individual’s own objectives or circumstances which should be the basis of any investment decision.\n\nAny guarantees under annuities issued by TIAA are subject to TIAA’s claims-paying ability.\n\nAnnuity contracts may contain terms for keeping them in force. We can provide you with costs and complete details.\n\nTIAA Traditional is a fixed annuity product issued through these contracts by Teachers Insurance and Annuity Association of America (TIAA), 730 Third Avenue, New York, NY, 10017: Form series including but not limited to: 1000.24; G-1000.4; IGRS-01-84-ACC; IGRSP-01-84-ACC; 6008.8. Not all contracts are available in all states or currently issued.\n\n4498957",
  "metadata": {
    "theme-color": "#2196F3",
    "description": "Set your employees up for retirement success with TIAA’s solutions for plan sponsors. Learn more about plan sponsor responsibilities and the latest trends.",
    "viewport": "width=device-width, initial-scale=1",
    "google-play-app": "app-id=com.mobile.tiaa.cref",
    "title": "Retirement Plan Sponsor Information and Solutions | TIAA",
    "template": "page-homepage",
    "favicon": "https://www.tiaa.org/content/dam/tiaa/global/logo/tiaa04016404.ico",
    "language": "en",
    "scrapeId": "ab0659fe-1366-410b-9bb3-e66afa79fa3c",
    "sourceURL": "https://www.tiaa.org/public/plansponsors",
    "url": "https://www.tiaa.org/public/plansponsors",
    "statusCode": 200,
    "contentType": "text/html;charset=utf-8",
    "proxyUsed": "basic",
    "cacheState": "miss",
    "creditsUsed": 1
  },
  "warning": "This scrape job was throttled at your current concurrency limit. If you'd like to scrape faster, you can upgrade your plan."
}